Repository: ClockGU/clock-backend
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de

source: A contract's start date can not be modified if shifts before this date exist.
de: Das Startdatum des Vertrags kann nicht geändert werden wenn bereits ältere Schichten existieren.

source: A contract's end date can not be modified if shifts after this date exist.
de: Das Enddatum des Vertrags kann nicht geändert werden wenn es Schichten nach diesem Datum gibt.

source: The start date of a contract must be set before it's end date.
de: Der Beginn eines Vertrages muss vor dessen Ende liegen.

source: A contract's end date must not be set in the past.
de: Der Vertrag darf nicht bereits in der Vergangheit geendet haben.

source: A contract must start on the 1st or 15th of a month.
de: Ein Vertrag darf nur am 1. oder 15. eines Monats beginnen.

source: A contract must end at the 14th or at the last day of a month.
de: Ein Vertrag darf nur am 14. oder am letzten Tag eines Monats enden.

source: The monthly work time must not be 0.
de: Die monatliche Arbeitszeit darf nicht 0 sein.

source: A shift must start and end on the same day.
de: Eine Schicht muss an dem gleichen Tag enden an dem sie angefangen hat.

source: The start of a shift must be set before it's end.
de: Der Beginn einer Schicht muss vor deren Ende liegen.

source: A shift must belong to a contract which is active on the respective date.
de: Eine Schicht muss zu einem zu dem Zeitpunkt laufenden Vertrag gehören.

source: An already exported shift can not be modified.
de: Eine Schicht die bereits exportiert wurde kann nicht mehr geändert werden.

source: The contract object must be owned by the user creating the shift.
de: Das Vertragsobjekt muss dem User gehören, der die Schicht erstellt.

source: Tags must be represented by a list and not by {}.
de: Tags müssen als Liste und nicht als {} dargestellt werden.

source: Tags must be strings.
de: Tags dürfen nur strings sein.

source: German
de: Deutsch

source: English
de: Englisch
